Rycbartbad/4ES/sdkconfig.defaults
# ESP-LEGO common defaults -- shared across all device roles
#
# These are the base settings.  Role-specific overrides go in
# sdkconfig.defaults.master and sdkconfig.defaults.sensor.
#
# Build with:
#   idf.py -DSDKCONFIG_DEFAULTS="sdkconfig.defaults;sdkconfig.defaults.master" build
#   idf.py -DSDKCONFIG_DEFAULTS="sdkconfig.defaults;sdkconfig.defaults.sensor" build

# Device role (one of the two below is set by the role-specific defaults)
# CONFIG_DEVICE_ROLE_MASTER=y
# CONFIG_DEVICE_ROLE_SENSOR is not set

# Chip target
CONFIG_IDF_TARGET="esp32s3"

# Serial flasher
CONFIG_ESPTOOLPY_MONITOR_BAUD_OTHER_VAL=115200

# Default `idf.py build` produces the Master firmware, which needs a
# larger factory app slot after LCD + LVGL are enabled.
# CONFIG_PARTITION_TABLE_SINGLE_APP is not set
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# LVGL: keep production builds lean; examples are not used by ESP-LEGO.
# CONFIG_LV_BUILD_EXAMPLES is not set
